In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({
    "Name":["a","b","c","d","a","b","a","b","a","c","c","d"],
    "Gender":["M","F","M","M","F","M","M","F","F","M","M","M"],
    "Sub_1":[12,13,14,12,13,14,15,23,25,16,10,12],
    "Sub_2":[23,24,25,26,27,28,29,30,25,34,35,36],
    "Total":[35,37,39,38,40,42,44,53,50,50,45,48]
})
print(data)

   Name Gender  Sub_1  Sub_2  Total
0     a      M     12     23     35
1     b      F     13     24     37
2     c      M     14     25     39
3     d      M     12     26     38
4     a      F     13     27     40
5     b      M     14     28     42
6     a      M     15     29     44
7     b      F     23     30     53
8     a      F     25     25     50
9     c      M     16     34     50
10    c      M     10     35     45
11    d      M     12     36     48

In [3]:
# Group the same name of Name column
new_data = data.groupby("Name")

In [4]:
# For print the groupby data we have to use loop
for i,j in new_data:
      print(i)
      print(j)
      print()

a
  Name Gender  Sub_1  Sub_2  Total
0    a      M     12     23     35
4    a      F     13     27     40
6    a      M     15     29     44
8    a      F     25     25     50

b
  Name Gender  Sub_1  Sub_2  Total
1    b      F     13     24     37
5    b      M     14     28     42
7    b      F     23     30     53

c
   Name Gender  Sub_1  Sub_2  Total
2     c      M     14     25     39
9     c      M     16     34     50
10    c      M     10     35     45

d
   Name Gender  Sub_1  Sub_2  Total
3     d      M     12     26     38
11    d      M     12     36     48

In [5]:
# I want to print only single name data i.e a
new_data.get_group("a")

  Name Gender  Sub_1  Sub_2  Total
0    a      M     12     23     35
4    a      F     13     27     40
6    a      M     15     29     44
8    a      F     25     25     50

In [6]:
# From gropby data i want to find the minimum value of sub_1 and sub_2 
new_data.min()

     Gender  Sub_1  Sub_2  Total
Name
a         F     12     23     35
b         F     13     24     37
c         M     10     25     39
d         M     12     26     38

In [14]:
# From gropby data i want to find the maximum value of sub_1 and sub_2 
new_data.max()

     Gender  Sub_1  Sub_2  Total
Name
a         M     25     29     50
b         M     23     30     53
c         M     16     35     50
d         M     12     36     48

In [15]:
# From groupby data i want to find the mean value of sub_1 and sub_2 
new_data[["Sub_1","Sub_2"]].mean()

          Sub_1      Sub_2
Name
a     16.250000  26.000000
b     16.666667  27.333333
c     13.333333  31.333333
d     12.000000  31.000000

In [16]:
new_data.Sub_1.sum()

Name
a    65
b    50
c    40
d    24
Name: Sub_1, dtype: int64

In [34]:
# Convert this new_data variable into list
#li = list(new_data)
#li

In [23]:
# Find the maximum total of male and female.
data.groupby("Gender").Total.max()

Gender
F    53
M    50
Name: Total, dtype: int64

In [26]:
# Group the name according to the minimum of sub_1
data.groupby("Name").Sub_1.min()

Name
a    12
b    13
c    10
d    12
Name: Sub_1, dtype: int64

In [30]:
# Group the gender according to the sum of sub_2
data.groupby("Gender").Sub_2.sum()

Gender
F    106
M    236
Name: Sub_2, dtype: int64

In [31]:
# find the minimum from the sum of sub2 and group it by Gender
data.groupby("Gender").Sub_2.sum().min()

106

In [32]:
# Find mean, max, min, count the no.of male and female from gender and group it
data.groupby("Gender").Sub_1.agg(["mean","max","min","count"])

          mean  max  min  count
Gender
F       18.500   25   13      4
M       13.125   16   10      8

In [37]:
# Find mean, max, min from gender and name columns and group it.
data.groupby(['Name','Gender']).Sub_2.agg(['mean','max','min','count'])

                  mean  max  min  count
Name Gender
a    F       26.000000   27   25      2
     M       26.000000   29   23      2
b    F       27.000000   30   24      2
     M       28.000000   28   28      1
c    M       31.333333   35   25      3
d    M       31.000000   36   26      2

In [42]:
# select gender, find avg(sub_2) and max(total) from data and group.
data.groupby("Gender").agg({"Sub_2":"mean","Total":"max"})

        Sub_2  Total
Gender
F        26.5     53
M        29.5     50

In [43]:
#plot the data
data.groupby('Gender').agg({'Sub_2':'mean','Total':'max'}).plot(kind='bar')

ImportError: matplotlib is required for plotting when the default backend "matplotlib" is selected.